{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"padding": "valid", "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "name": "conv2d_1", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "name": "conv2d_2", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "units": 128, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "units": 10, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null}}], "name": "sequential_1"}}