{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "filters": 32, "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_33", "padding": "valid", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "filters": 64, "name": "conv2d_34", "padding": "valid", "activity_regularizer": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_14", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_29", "seed": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_14", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 128, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_30", "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 10, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_33", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null}}], "name": "sequential_22"}, "keras_version": "2.2.4", "backend": "tensorflow"}